Repository: ProSuite/ProSuite
Catalog: src/ProSuite.DomainServices.AO/QA/HtmlReports/HtmlReportResources.*.resx
Languages: de

# HtmlTexts_QualitySpecificationTitle
source: Quality Specification
de: Qualitätsspezifikation

# HtmlTexts_DateOfVerification
source: Date of verification
de: Prüfdatum

# HtmlTexts_ProcessingTime
source: Processing time
de: Prüfdauer

# HtmlTexts_Warnings
source: Warnings
de: Warnungen

# HtmlTexts_Errors
source: Errors
de: Fehler

# HtmlTexts_VerifiedExtent
source: Verified extent
de: Prüfausschnitt

# HtmlTexts_AreaOfInterestDescription
source: AOI description
de: Beschreibung des Prüfperimeters

# HtmlTexts_AreaOfInterestFeatureSource
source: AOI feature source
de: Feature-Auswahl für Prüfperimeter

# HtmlTexts_AreaOfInterestBufferDistance
source: AOI buffer distance
de: Bufferdistanz

# HtmlTexts_AreaOfInterestClipExtent
source: AOI clip extent
de: Verarbeitungsausschnitt

# HtmlTexts_OutputDirectory
source: Output directory
de: Ausgabeverzeichnis

# HtmlTexts_OriginalPath
source: orig. path
de: Orig. Pfad

# HtmlTexts_MapDocument
source: Map document
de: Fehlerkarte

# HtmlTexts_VerificationReport
source: Verification report
de: Prüfbericht

# HtmlTexts_VerificationCancelledMessage
source: The verification was cancelled
de: Die Prüfung wurde abgebrochen

# HtmlTexts_ColumnHeadingQualityCondition
source: Quality condition
de: Qualitätsbedingung

# HtmlTexts_ColumnHeadingQualityConditions
source: Verified conditions
de: Geprüfte Qualitätsbedingungen

# HtmlTexts_ColumnHeadingIssueDescription
source: Issue description
de: Problembeschreibung

# HtmlTexts_ColumnHeadingAffectedComponent
source: Affected components
de: Betroffene Elemente

# HtmlTexts_ColumnHeadingIssueType
source: Type
de: Typ

# HtmlTexts_ColumnHeadingIssueCount
source: Issue count
de: Meldungen

# HtmlTexts_DatasetReport
source: Dataset report
de: Datensatzbericht

# HtmlTexts_IssueDatabase
source: Issue database
de: Meldungsdatenbank

# HtmlTexts_Description
source: Description
de: Beschreibung

# HtmlTexts_DataSource
source: Data source
de: Datenquelle

# HtmlTexts_DataSources
source: Data Sources
de: Datenquellen

# HtmlTexts_RegisteredAsVersioned
source: Registered as versioned
de: Registriert als versioniert

# HtmlTexts_Yes
source: Yes
de: Ja

# HtmlTexts_No
source: No
de: Nein

# HtmlTexts_VersionName
source: Version Name
de: Versionsname

# HtmlTexts_GeometryType
source: Geometry type
de: Geometrietyp

# HtmlTexts_XYTolerance
source: XY Tolerance
de: XY-Toleranz

# HtmlTexts_XYCoordinateSystem
source: Coordinate system
de: Koordinatensystem

# HtmlTexts_XYResolution
source: XY resolution
de: XY-Auflösung

# HtmlTexts_FeatureCount
source: Feature count
de: Anzahl Features

# HtmlTexts_FeaturesWithoutGeometry
source: Features without geometry
de: Features ohne Geometrie

# HtmlTexts_FeaturesWithNonLinearSegments
source: Feat. with non-linear Seg.
de: Feat. mit nicht-linearen Seg.

# HtmlTexts_RowCount
source: Row count
de: Anzahl Objekte

# HtmlTexts_NoCategory
source: <No category>
de: <Keine Kategorie>

# HtmlTexts_ColumnHeadingExceptionCount
source: Exceptions
de: Ausnahmen

# HtmlTexts_DatasetName
source: Dataset name
de: Datensatzname
