Repository: ProSuite/ProSuite
Catalog: src/ProSuite.QA.Tests.Definitions/Properties/LocalizableStrings.*.resx
Languages: de

# QaEdgeMatchCrossingLines_NoMatch_NoCandidate
source: No nearby neighbor feature connected to the border exists.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# QaEdgeMatchCrossingLines_BordersNotCoincident
source: Borders are not coincident.
de: Grenzverlauf stimmt nicht überein.

# QaEdgeMatchCrossingLines_NoMatch_CandidateExists
source: No exact match. Nearby feature connected to the border exists, nearest end point on border: {0}.
de: Keine exakte Fortsetzung. Nachbarfeature mit Grenzverknüpfung in der Nähe, Distanz zu Endpunkt: {0}.

# QaEdgeMatchCrossingLines_NoMatch_CandidateExists_EndPointOutsideTolerance
source: No exact match. Nearby feature connected to the border exists, nearest end point on border: {0} (too far). Distance to neighbor line: {1}.
de: Keine exakte Fortsetzung. Nachbarfeature mit Grenzverknüpfung, Distanz zu Endpunkt: {0} (zu groß). Distanz zu Linie: {1}.

# QaEdgeMatchCrossingLines_NoMatch_NoCandidate_ConnectedOnSameSide
source: No nearby neighbor feature connected to the border exists. The end point connects to another feature on the same side.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz. Der Endpunkt ist mit einem anderen Feature auf derselben Seite verknüpft.

# EdgeMatchUtils_AttributeConstraints_ConstraintNotFulfilled
source: Constraint is not fulfilled ({0})
de: Bedingung nicht erfüllt ({0})

# EdgeMatchUtils_AttributeConstraints_ValuesNotEqual
source: Values are not equal ({0})
de: Werte nicht gleich ({0})

# QaEdgeMatchCrossingAreas_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists (common boundary length: {0}). {1}.
de: Es existiert ein passendes Nachbar-Feature (Länge der gemeinsamen Grenze: {0}). {1}.

# QaEdgeMatchBorderingLines_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists (common boundary length: {0}). {1}.
de: Es existiert ein passendes Nachbar-Feature (Länge der gemeinsamen Grenze: {0}). {1}.

# QaEdgeMatchBorderingLines_PartlyOutsideVerifiedExtent
source: The border line is partly outside the verified extent.
de: Der Grenzverlauf liegt teilweise außerhalb des geprüften Bereichs.

# QaEdgeMatchCrossingAreas_PartlyOutsideVerifiedExtent
source: The border line is partly outside the verified extent.
de: Der Grenzverlauf liegt teilweise außerhalb des geprüften Bereichs.

# QaEdgeMatchCrossingAreas_NoMatch_CandidateExists
source: No exact match. A nearby neighbor feature connected to the border exists. Borders are not coincident.
de: Kein passendes Nachbar-Feature. Nachbarfeature mit Grenzverknüpfung in der Nähe. Grenzverlauf stimmt nicht überein.

# QaEdgeMatchBorderingLines_NoMatch_CandidateExists
source: No exact match. A nearby neighbor feature connected to the border exists. The borders are not coincident where the lines touch their border.
de: Kein passendes Nachbar-Feature. Nachbarfeature mit Grenzverknüpfung in der Nähe. Grenzverlauf stimmt nicht überein.

# QaEdgeMatchCrossingAreas_NoMatch_NoCandidate
source: No nearby neighbor feature connected to the border exists.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# QaEdgeMatchBorderingLines_Match_EndPointNotCoincident
source: A matching neighbor feature exists, but a line end point is not coincident.
de: Es existiert ein passendes Nachbar-Feature, aber ein Linienendpunkt stimmt nicht überein.

# QaEdgeMatchBorderingLines_NoMatch_NoCandidate
source: No nearby neighbor feature connected to the border exists.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# QaEdgeMatchBorderingPoints_BordersNotCoincident
source: Borders are not coincident.
de: Grenzverlauf stimmt nicht überein.

# QaEdgeMatchBorderingPoints_NoMatch_NoCandidate
source: No neighboring border point found within search distance.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# QaEdgeMatchBorderingPoints_NoMatch_CandidateExists
source: No exact match. A nearby neighbor feature connected to the border exists (distance: {0}).
de: Kein passendes Nachbar-Feature. Nachbarfeature mit Grenzverknüpfung in der Nähe, Distanz: {0}.

# VertexCoincidenceChecker_NearbyEdgeNotPassingThroughVertex_DifferentFeature
source: Nearby edge does not pass through vertex (distance to edge: {0})
de: Benachbarter Linienverlauf verläuft nicht durch den Stützpunkt (Distanz zum benachbarten Linienverlauf: {0} Suchradius)

# VertexCoincidenceChecker_NearbyEdgeNotPassingThroughVertex_SameFeature
source: Nearby edge on same feature does not pass through vertex (distance to edge: {0})
de: Benachbarter Linienverlauf auf demselben Feature verläuft nicht durch den Stützpunkt (Distanz zum benachbarten Linienverlauf: {0} Suchradius)

# VertexCoincidenceChecker_NearbyVertexNotCoincident_DifferentFeature
source: Nearby vertex is not coincident (distance: {0})
de: Benachbarter Stützpunkt fällt nicht mit diesem Stützpunkt zusammen (Distanz zum Stützpunkt: {0} Suchradius)

# VertexCoincidenceChecker_NearbyVertexNotCoincident_SameFeature
source: Nearby vertex on same feature is not coincident (distance: {0})
de: Benachbarter Stützpunkt auf demselben Feature fällt nicht mit diesem Stützpunkt zusammen (Distanz zum Stützpunkt: {0} Suchradius)

# VertexCoincidenceChecker_NoVertexOnNearbyEdge_DifferentFeature
source: Nearby edge does not have a coincident vertex (distance to edge: {0})
de: Kein zusammenfallender Stützpunkt gefunden auf benachbartem Linienverlauf (Distanz zum Linienverlauf: {0} Suchradius)

# VertexCoincidenceChecker_NoVertexOnNearbyEdge_SameFeature
source: Nearby edge on same feature does not have a coincident vertex (distance to edge: {0})
de: Kein zusammenfallender Stützpunkt gefunden auf benachbartem Linienverlauf auf demselben Feature (Distanz zum Linienverlauf: {0} Suchradius)

# QaFullCoincidence_PartNotNearReference
source: Part not near reference
de: Linienverlauf ist zu weit von der Referenzlinie entfernt

# QaNearCoincidenceBase_NearlyCoincidentSection_Extended_Base
source: Part within near distance of {0} is {1} long (> {2})
de: Länge des Linienverlaufs innerhalb der Annäherungstoleranz {0} ist {1} (> {2})

# QaNearCoincidenceBase_NearlyCoincidentSection_Extended_ConnectedPaths
source: ; the paths are connected
de: ; die Linienverläufe sind verknüpft

# QaNearCoincidenceBase_NearlyCoincidentSection_Extended_DisjointPaths
source: ; the closest distance is {0}
de: ; die kürzeste Distanz zwischen den Linienverläufen ist {0}

# QaNearCoincidenceBase_NearlyCoincidentSection_Short
source: Part near {0} > {1}
de: Länge des Linienverlaufs innerhalb der Annäherungstoleranz ist {0} (> {1})

# QaSimpleGeometry_Empty
source: Geometry is empty
de: Die Geometrie ist leer

# QaSimpleGeometry_Null
source: Geometry is null
de: Die Geometrie ist NULL

# QaGeometryConstraint_ConstraintNotFulfilled_ForShapePart
source: Constraint is not fulfilled for geometry part: {0} ({1})
de: Die Bedingung ist nicht erfüllt für einen Geometrieteil: {0} ({1})

# QaGeometryConstraint_QaGeometryConstraint_ConstraintNotFulfilled_ForShape
source: Constraint is not fulfilled for shape: {0} ({1})
de: Die Bedingung ist nicht erfüllt für die Feature-Geometrie: {0} ({1})

# VertexCoincidenceChecker_ZDifference_CoincidentEdge_DifferentFeature
source: Z of coincident point on edge differs (Z difference: {0})
de: Abweichender Z-Wert entlang zusammenfallendem Linienverlauf (Z-Abstand: {0})

# VertexCoincidenceChecker_ZDifference_CoincidentEdge_SameFeature
source: Z of coincident point on edge of same feature differs (Z difference: {0})
de: Abweichender Z-Wert entlang zusammenfallendem Linienverlauf auf demselben Feature (Z-Abstand: {0})

# VertexCoincidenceChecker_ZDifference_CoincidentVertex_DifferentFeature
source: Z of coincident vertex differs (Z difference: {0})
de: Zusammenfallender Stützpunkt hat einen abweichenden Z-Wert (Z-Abstand: {0})

# VertexCoincidenceChecker_ZDifference_CoincidentVertex_SameFeature
source: Z of coincident vertex on same feature differs (Z difference: {0})
de: Zusammenfallender Stützpunkt auf demselben Feature hat einen abweichenden Z-Wert (Z-Abstand: {0})

# QaNoGaps_GapFound
source: Gap found ( area:
de: Lücke gefunden (Fläche:

# QaNoGaps_SliverParameters
source: ; perimeter * perimeter / area: {0}; perimeter: {1}
de: ; Perimeter * Perimeter / Fläche: {0}; Perimeter: {1}

# QaTopoNotNear_NearlyCoincidentSection_WithinNear
source: Segments are fully within near distance of other segments
de: Segmente liegen vollständig innerhalb des Annäherungsbereichs von anderen Segmenten

# QaTopoNotNear_NearlyCoincidentSection_Connected_Loop_WithinNear
source: Connected segments form a loop and are within near distance to other connected segments
de: Verknüpfte Segmente bilden eine geschlossene Schleife und liegen innerhalb des Annäherungsbereichs von anderen Segmenten

# QaTopoNotNear_NearlyCoincidentSection_Connected_Loop
source: Connected segments within near distance form a loop
de: Verknüpfte Segmente bilden eine geschlossene Schleife innerhalb des eigenen Annäherungsbereichs

# QaTopoNotNear_NearlyCoincidentSection_WithinNear_Connected
source: Segments are fully within near distance of other segments to which they are connected
de: Segmente liegen vollständig innerhalb des Annäherungsbereichs von anderen Segmenten, mit denen sie verknüpft sind

# QaTopoNotNear_NearlyCoincidentSection_Connected
source: Part within near distance is {0} long (>= {1}); the paths are connected
de: Länge des Linienverlaufs innerhalb der Annäherungsdistanz ist {0} (>= {1}); die Verläufe sind verknüpft

# QaTopoNotNear_NearlyCoincidentSection_Disjoint
source: Part within near distance is {0} long (>= {1}); the paths are disjoint
de: Länge des Linienverlaufs innerhalb der Annäherungsdistanz ist {0} (>= {1}); die Verläufe berühren sich nicht

# QaTopoNotNear_NearlyCoincidentSection_Crossing
source: Part within near distance is {0} long (>= {1}); the paths are crossing but not connected
de: Länge des Linienverlaufs innerhalb der Annäherungsdistanz ist {0} (>= {1}); die Verläufe kreuzen sich, sind aber nicht verknüpft

# QaTopoNotNear_CoincidentSectionFound
source: Coincident section found
de: Linienverläufe sind deckungsgleich

# QaTopoNotNear_ShortSubpart
source: Feature with unconnected ends is too short: {0}
de: Feature mit nicht verknüpftem Endpunkt ist zu kurz: {0}

# QaTopoNotNear_InconsistentLineSymbolEnd
source: Inconsistent line symbol end (end segment is too short compared to the symbol width)
de: Inkonsistentes Liniensymbol-Ende (letztes Segment ist zu kurz im Vergleich zur Symbolbreite)

source: . Vertex: {0}, {1}
de: . Stützpunkt: {0}, {1}

# VertexCoincidenceChecker_NoVertexOnNearbyEdge_ReportCoordinatesSuffix
source: . Vertex: {0}, {1}
de: . Stützpunkt: {0}, {1}

# VertexCoincidenceChecker_NearbyVertexNotCoincident_ReportCoordinatesSuffix
source: . Vertex: {0}, {1}; nearby vertex: {2}, {3}
de: . Stützpunkt: {0}, {1}; benachbarter Stützpunkt: {2}, {3}
