Repository: ProSuite/ProSuite
Catalog: src/ProSuite.DomainServices.AO/Properties/LocalizableStrings.*.resx
Languages: de

# IssueMapUtils_DataFrameName
source: Verification results
de: Prüfresultate

# IssueMapUtils_GroupLayerName_Errors
source: Errors
de: Fehler

# IssueMapUtils_GroupLayerName_Raw
source: Issue feature classes
de: Meldungs-Feature-Klassen

# IssueMapUtils_GroupLayerName_Warnings
source: Warnings
de: Warnungen

# RuleBasedVerificationFunctionBase_CreateParameterInfo_OutputDirectory
source: Output directory
de: Ausgabeverzeichnis

# RuleBasedVerificationFunctionBase_CreateParameterInfo_Categories
source: Categories
de: Kategorien

# RuleBasedVerificationFunctionBase_CreateParameterInfo_ObjectClass
source: Object Class
de: Objektklasse

# RuleBasedVerificationFunctionBase_CreateParameterInfo_VerificationTileSize
source: Verification Tile Size
de: Kachelgröße

# HtmlReports_IssueType_Error
source: Error
de: Fehler

# HtmlReports_IssueType_Warning
source: Warning
de: Warnung

# IssueMapUtils_GroupLayerName_Issues
source: Issues
de: Meldungen

# IssueMapUtils_GroupLayerName_Exceptions
source: Exceptions
de: Ausnahmen

# RawIssuesLayerName_Multipoint
source: Point issues
de: Punkt-Meldungen

# RawIssuesLayerName_Polyline
source: Polyline issues
de: Linien-Meldungen

# RawIssuesLayerName_Polygon
source: Polygon issues
de: Polygon-Meldungen

# RawIssuesLayerName_MultiPatch
source: Multipatch issues
de: Multipatch-Meldungen

# ExceptionLayerName_Multipoint
source: Point exceptions
de: Punkt-Ausnahmen

# ExceptionLayerName_Polyline
source: Polyline exceptions
de: Linien-Ausnahmen

# ExceptionLayerName_Polygon
source: Polygon exceptions
de: Polygon-Ausnahmen

# ExceptionLayerName_MultiPatch
source: Multipatch exceptions
de: Multipatch-Ausnahmen

# IssuesStandaloneTableName
source: Issues without geometry
de: Meldungen ohne Geometrie

# ExceptionStandaloneTableName
source: Exceptions without geometry
de: Ausnahmen ohne Geometrie

# AoiLayerName
source: Area of Interest
de: Geprüftes Gebiet

# IssueStatisticsTableName
source: Issue Statistics
de: Meldungs-Statistik

# ImportExceptionsFunctionBase_FormatConflicts
source: Attribute conflict(s): {0}
de: Attributkonflikt(e): {0}

# ExceptionLayerHierarchy_UsageLevel_UsedLayerName
source: Used exceptions
de: Verwendete Ausnahmen

# ExceptionLayerHierarchy_UsageLevel_UnusedLayerName
source: Unused exceptions
de: Nicht verwendete Ausnahmen

# ExceptionLayerHierarchy_IssueAssignmentLevel_UnassignedLayerName
source: No issue assignment
de: Keine Zuweisung

# ExceptionLayerHierarchy_IssueAssignmentLevel_AssignedLayerFormat
source: Issue assignment {0}
de: Zuweisung {0}

# ExceptionLayerHierarchy_ExceptionCategoryLevel_NoCategoryLayerName
source: No exception category
de: Keine Ausnahmekategorie

# ExceptionLayerHierarchy_ExceptionCategoryLevel_CategoryLayerFormat
source: Exception category {0}
de: Ausnahmekategorie {0}

# IssueMapContent_RawExceptionLayers_GroupLayerName
source: All exceptions
de: Alle Ausnahmen

# IssueMapUtils_RawExceptionLayerNameFormat
source: {0} (all)
de: {0} (alle)

# IssueMapUtils_GroupedExceptionLayer_UnusedSuffix
source: not used
de: nicht verwendet

# IssueMapUtils_GroupedExceptionLayerDescription_ExceptionCountFormat
source: Number of exceptions: {0:N0}
de: Anzahl Ausnahmen: {0:N0}

# IssueMapUtils_GroupedExceptionLayerDescription_IssueAssignmentFormat
source: - Issue assignment: {0}
de: - Zuweisung: {0}

# IssueMapUtils_GroupedExceptionLayerDescription_ExceptionCategoryFormat
source: - Exception category: {0}
de: - Ausnahmekategorie: {0}

# IssueMapUtils_GroupedExceptionLayerDescription_IsUsed
source: - The exceptions matched a reported issue
de: - Die Ausnahmen wurden bei der Prüfung einer Meldung zugewiesen

# IssueMapUtils_GroupedExceptionLayerDescription_IsNotUsed
source: - The exceptions did not match a reported issue
de: - Die Ausnahmen wurden bei der Prüfung keiner Meldung zugewiesen
