Repository: ProSuite/ProSuite
Catalog: src/ProSuite.QA.Tests/IssueCodes/IssueCodeDescriptions.*.resx
Languages: de

# CrossingLines_NoMatch_CandidateExists_ConstraintsNotFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The distance to its border connection exceeds the maximum value.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Distanz zu dessen Endpunkt auf der Grenze ist zu groß.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The distance to its border connection exceeds the maximum value. The borders are not coincident at the line end points.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Distanz zu dessen Endpunkt auf der Grenze überschreitet die maximale Distanz. Die Grenzverläufe stimmen bei den Linienendpunkten nicht überein.

# CrossingLines_NoMatch_NoCandidate_ConnectedOnSameSide
source: No matching neighbor feature. No neighbor feature connected to the border found within search distance. The end point connects to another feature on the same side.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz. Der Linienendpunkt auf der Grenze ist mit einer anderen Linie auf derselben Seite verknüpft.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The distance to its border connection exceeds the maximum value. Attribute constraints are not fulfilled. The borders are not coincident at the line end points.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Distanz zu dessen Endpunkt auf der Grenze ist zu groß. Attributbed. sind nicht erfüllt. Grenzverläufe stimmen bei den Endpunkten nicht überein.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The distance to its border connection exceeds the maximum value. Attribute constraints are not fulfilled.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Distanz zu dessen Endpunkt auf der Grenze ist zu groß. Die Attributbedingungen sind für dieses Feature nicht erfüllt.

# BorderingPoints_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists, but attribute constraints are not fulfilled.
de: Es existiert ein passendes Nachbar-Feature, aber Attributbedingungen sind nicht erfüllt.

# BorderingPoints_NoMatch_CandidateExists_ConstraintsFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The borders are not coincident at the point locations.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Grenzverläufe stimmen bei den Punkten nicht überein.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature. The borders are not coincident at the point locations.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt. Die Grenzverläufe stimmen bei den Punkten nicht überein.

# BorderingPoints_NoMatch_CandidateExists_ConstraintsNotFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt.

# BorderingPoints_NoMatch_NoCandidate
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# CrossingAreas_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists, but attribute constraints are not fulfilled.
de: Es existiert ein passendes Nachbar-Feature, aber Attributbedingungen sind nicht erfüllt.

# CrossingAreas_NoMatch_CandidateExists_BordersNotCoincident_ConstraintsFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The border lines are not coincident where the features touch the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Grenzverläufe stimmen entlang der Features nicht überein.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature. The border lines are not coincident where the features touch the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt. Die Grenzverläufe stimmen entlang der Features nicht überein.

# CrossingAreas_NoMatch_NoCandidate
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# CrossingAreas_NoMatch_NoCandidate_PartlyOutsideVerifiedExtent
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance. The border line is partly outside the verified extent.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz. Der Grenzverlauf liegt teilweise außerhalb des geprüften Bereichs.

# BorderingLines_NoMatch_NoCandidate_PartlyOutsideVerifiedExtent
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance. The border line is partly outside the verified extent.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz. Der Grenzverlauf liegt teilweise außerhalb des geprüften Bereichs.

# BorderingLines_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists, but attribute constraints are not fulfilled.
de: Es existiert ein passendes Nachbar-Feature, aber Attributbedingungen sind nicht erfüllt.

# BorderingLines_NoMatch_CandidateExists_BordersNotCoincident_ConstraintsFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The border lines are not coincident where the features touch the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Grenzverläufe stimmen entlang der Features nicht überein.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature. The borders are not coincident where the features touch the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt. Die Grenzverläufe stimmen entlang der Features nicht überein.

# BorderingLines_NoMatch_NoCandidate
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# BorderingLines_Match_EndPointNotCoincident
source: A matching neighbor feature exists, but a line end point is not coincident.
de: Es existiert ein passendes Nachbar-Feature, aber ein Linienendpunkt stimmt nicht überein.

# VertexCoincidence_NearbyEdgeNotPassingThroughVertex_DifferentFeature
source: Nearby edge on different feature does not pass through vertex
de: Benachbarte Kante auf anderem Feature verläuft nicht durch den Stützpunkt

# VertexCoincidence_NearbyEdgeNotPassingThroughVertex_SameFeature
source: Nearby edge on same feature does not pass through vertex
de: Benachbarte Kante auf demselben Feature verläuft nicht durch den Stützpunkt

# VertexCoincidence_NearbyVertexNotCoincident_DifferentFeature
source: Nearby vertex on different feature is not coincident
de: Benachbarter Stützpunkt auf anderem Feature fällt nicht mit dem Stützpunkt zusammen

# VertexCoincidence_NearbyVertexNotCoincident_SameFeature
source: Nearby vertex on same feature is not coincident
de: Benachbarter Stützpunkt auf demselben Feature fällt nicht mit dem Stützpunkt zusammen

# VertexCoincidence_NoVertexOnNearbyEdge_DifferentFeature
source: Nearby edge on different feature does not have a coincident vertex
de: Benachbarte Kante auf anderem Feature hat keinen zusammenfallenden Stützpunkt

# VertexCoincidence_NoVertexOnNearbyEdge_SameFeature
source: Nearby edge on same feature does not have a coincident vertex
de: Benachbarte Kante auf demselben Feature hat keinen zusammenfallenden Stützpunkt

# FullCoincidence_PartNotNearReference
source: Part not near reference
de: Linienverlauf ist zu weit von der Referenzlinie entfernt

# NearCoincidence_NearlyCoincidentSection_BetweenFeatures
source: Nearly coincident section found (between different features)
de: Fast zusammenfallender Linienverlauf gefunden (zwischen unterschiedlichen Features)

# NearCoincidence_NearlyCoincidentSection_WithinFeature
source: Nearly coincident section found (within the same feature)
de: Fast zusammenfallender Linienverlauf gefunden (innerhalb desselben Features)

# GdbNetworkElements_ComplexEdge_ErrorAccessingGeometry
source: Error getting geometry for complex edge element
de: Fehler beim Lesen der Geometrie für eine komplexe Netzwerkkante

# GdbNetworkElements_ComplexEdge_InvalidComplexEdge
source: Invalid complex edge element
de: Ungültiges Netzwerkelement für eine komplexe Kante

# GdbNetworkElements_ComplexEdge_ZeroLength
source: Complex edge geometry is zero-length
de: Komplexe Netzwerkkante hat Länge 0

# GdbNetworkElements_ErrorProcessingNetworkFeature
source: An error ocurred, network feature could not be processed
de: Ein Fehler ist aufgetreten, Netzwerkfeature konnte nicht verarbeitet werden

# GdbNetworkElements_InvalidElementID_ComplexJunction
source: Complex junction has an invalid element id
de: Komplexer Netzwerkknoten hat eine ungültige Element-ID

# GdbNetworkElements_InvalidElementID_Edge_FromJunction
source: From junction has an invalid element id
de: Anfangsknoten hat eine ungültige Element-ID

# GdbNetworkElements_InvalidElementID_Edge_ToJunction
source: To junction has an invalid element id
de: Endknoten hat eine ungültige Element-ID

# GdbNetworkElements_InvalidElementID_SimpleEdge
source: Simple edge has an invalid element id
de: Einfache Netzwerkkante hat eine ungültige Element-ID

# GdbNetworkElements_InvalidElementID_SimpleJunction
source: Simple junction has an invalid element id
de: Einfacher Netzwerkknoten hat eine ungültige Element-ID

# EmptyNotNullTextFields_EmptyText
source: Empty text in field
de: Field enthält leeren Text

# EmptyNotNullTextFields_UnexpectedValue
source: Text field has unexpected value
de: Textfeld hat unerwarteten Wert

# EmptyNotNullTextFields_ValueIsNull
source: Text field value is null
de: Textfeld enthält NULL

# Extent_ExtentLargerThanLimit
source: Feature extent is larger than the limit
de: Ausdehnung des Features ist grösser als der definierte Maximalwert

# FlowLogic_OutgoingLines_Multiple
source: Node has multiple outgoing lines
de: Der Knoten hat mehrere abgehende Linien

# FlowLogic_OutgoingLines_None
source: Node has no outgoing lines
de: Der Knoten hat keine abgehenden Linien

# GdbConnectivity_NetworkConnectivityError
source: Connectivity problem in network
de: Konnektivitätsproblem im Netzwerk

# GdbConnectivity_NetworkConnectivityError_RepairedDuringTestrun
source: Connectivity problem in network. The network was edited and the problem was repaired
de: Konnektivitätsproblem im Netzwerk. Das Netzwerk wurde bearbeitet und das Problem repariert.

# GdbConstraint_GdbConstraintNotFulfilled
source: Geodatabase attribute rule not fulfilled
de: Attributregel der Geodatenbank ist nicht erfüllt

# GdbConstraint_InvalidRuleDefinition
source: A geodatabase attribute rule is incorrectly defined
de: Attributregel der Geodatenbank ist nicht korrekt definiert

# GdbTopology_DirtyArea
source: Dirty area found (topology not validated)
de: Nicht überprüfter Bereich gefunden (Topologie wurde nicht validiert)

# GdbTopology_RuleNotFulfilled
source: A topology rule is not fulfilled
de: Topologieregel ist nicht erfüllt

# GdbTopology_ValidationFailed
source: The topology validation failed
de: Bei der Topologievalidierung ist ein Fehler aufgetreten.

# GraphicConflict_SymbolsIntersect
source: Symbols intersect
de: Die Symbole überschneiden sich

# DateFieldsWithoutTime_HasTimePart
source: The date value has a time part
de: Der Datumswerte enthält eine Zeitangabe

# DateFieldsWithoutTime_InvalidDateValue
source: Invalid date value
de: Ungültiger Datumswert

source: The feature is not covered by any feature within the verified extent for which the defined constraint is fulfilled (the tested feature extends beyond the verified extent)
de: Das Feature ist innerhalb des geprüften Ausschnitts durch kein anderes Feature abgedeckt, für welches die Attributbedingung erfüllt ist (das geprüfte Feature erstreckt sich bis außerhalb des geprüften Ausschnitts)

# CoveredByOther_NotCoveredByAnyFeature_WithFulfilledConstraint
source: The feature is not covered by any feature for which the defined constraint is fulfilled
de: Das Feature ist durch kein anderes Feature abgedeckt, für welches die Attributbedingung erfüllt ist

# CoveredByOther_NotFullyCovered_WithFulfilledConstraint
source: The feature is not fully covered by other features for which the defined constraint is fulfilled
de: Das Feature ist nicht vollständig durch andere Features abgedeckt, für welches die Attributbedingung erfüllt ist

# CoveredByOther_NotSufficientlyCovered_WithFulfilledConstraint
source: The feature is not sufficiently covered by other features for which the defined constraint is fulfilled (the covered percentage is smaller than the minimum value)
de: Das Feature ist nicht ausreichend durch andere Features abgedeckt, für welche die Attributbedingung erfüllt ist (der abgedeckte prozentuale Anteil ist kleiner als der Minimalwert)

# DangleCount_InvalidNumberOfDangles
source: Polyline feature has invalid number of dangles
de: Linienfeature hat ungültige Anzahl freier Endpunkte

# CoplanarRings_FaceNotCoplanar
source: Face is not coplanar
de: Teilfläche ist nicht koplanar

# CoplanarRings_FaceDoesNotDefineValidPlane
source: Face does not define a valid plane (segments are collinear)
de: Teilfläche definiert keine gültige Ebene

# ContainedPoints_PointCount_LargerThanExpected
source: Number of contained points larger than expected number
de: Anzahl enthaltener Punkt ist grösser als der erwartete Wert

# ContainedPoints_PointCount_LargerThanMaximum
source: Number of contained points larger than the specified maximum
de: Anzahl enthaltener Punkt ist grösser als der definierte Maximalwert

# ContainedPoints_PointCount_SmallerThanExpected
source: Number of contained points smaller than expected number
de: Anzahl enthaltener Punkt ist kleiner als der erwartete Wert

# ContainedPoints_PointCount_SmallerThanMinimum
source: Number of contained points less than the specified minimum
de: Anzahl enthaltener Punkt ist kleiner als der definierte Minimalwert

# Centroids_CentroidLiesOnBorder
source: Centroid lies on a border
de: Zentroid liegt auf einer Grenzlinie

# Centroids_DanglingLine
source: Dangling line
de: Freier Linienendpunkt

# Centroids_DoesNotMatchConstraint
source: Centroid does not match constraint
de: Zentroid erfüllt Attributbedingung nicht

# Centroids_MultipleCentroids
source: Multiple centroids inside constructed polygon
de: Mehrere Zentroide liegen innerhalb eines konstruierten Polygons

# Centroids_NoCentroid
source: Constructed polygon contains no centroid
de: Konstruiertes Polygon enthält kein Zentroid

# BorderSense_DanglingLine
source: Dangling line
de: Freier Linienendpunkt

# BorderSense_EmptyPolygonCreated
source: Empty polygon created
de: Konstruiertes Polygon ist leer

# BorderSense_IncompleteLine
source: Incomplete line
de: Unvollständige Linie

# BorderSense_InconsistentOrientation
source: Inconsistent orientation
de: Inkonsistente Orientierung

# BorderSense_InvertedOrientation
source: Inverted orientation
de: Inkorrekte Orientierung

# LineGroups_InvalidFieldValue_InvalidValueForSeparator
source: The field value is invalid
de: Der Feldwert ist ungültig

# LineGroups_InvalidFieldValue_DuplicateGroupValueInField
source: The field value contains the same group value more than once
de: Der Feldwert enthält denselben Gruppenwert mehr als einmal

# ConnectedLineGroups_InvalidLineGroup_Branch
source: The line group contains a branch
de: Die Liniengruppe enthält eine Verzweigung

# ConnectedLineGroups_InvalidLineGroup_Cycle
source: The line group contains a cycle
de: Die Liniengruppe enthält einen geschlossenen Zyklus

# ConnectedLineGroups_InvalidLineGroup_InsideBranch
source: The line group contains a branch to the interior of a cycle
de: Die Liniengruppe enthält eine Verzweigung im Inneren eines Zyklus

# ConnectedLineGroups_InvalidLineGroup_MultipleParts
source: The line group consists of more than one connected part
de: Die Liniengruppe enthält nicht verbundene Untergruppen

# GroupConstraints_DistinctValues_NotExpectedNumber
source: Number of distinct values in group not as expected
de: Unerwartete Anzahl unterschiedlicher Werte in der Gruppe

# GroupConstraints_DistinctValues_NotInExpectedRange
source: Number of distinct values in group not in the expected range
de: Anzahl unterschiedlicher Werte in der Gruppe liegt außerhalb des erwarteten Bereichs

# GroupConstraints_DistinctValues_TooFew
source: Too few distinct values in group
de: Anzahl unterschiedlicher Werte in der Gruppe unterschreitet den Minimalwert

# GroupConstraints_DistinctValues_TooMany
source: Too many distinct values in group
de: Anzahl unterschiedlicher Werte in der Gruppe überschreitet den Maximalwert

# HorizontalSegments_NotSufficientlyHorizontal_ConsecutiveSegments
source: Consecutive segments are almost, but not sufficently horizontal
de: Aufeinanderfolgende Segmente sind annähernd, aber nicht ausreichend horizontal

# HorizontalSegments_NotSufficientlyHorizontal_Segment
source: The segment is almost, but not sufficently horizontal
de: Das Segment ist annähernd, aber nicht ausreichend horizontal

# IntersectionMatrix_NoIntersection
source: No intersection
de: Keine Überschneidung

# LineConnections_RulesNotFulfilled
source: Features do not fulfill any of the rules for valid connections
de: Objekte erfüllen keine der Regeln für gültige Verbindungen

# LineIntersectAngle_IntersectionAngleSmallerThanLimit
source: Line intersection angle smaller than the specified minimum
de: Schnittwinkel der Linien ist kleiner als der definierte Minimalwert

# LineIntersections_InvalidLineIntersection
source: Invalid line intersection
de: Unerlaubter Linienschnittpunkt

# LineIntersections_InvalidLineIntersection_ConstraintNotFulfilled
source: Invalid line intersection (attribute constraint is not fulfilled)
de: Unerlaubter Linienschnittpunkt (Attributbedingungen sind nicht erfüllt)

# LineIntersectZ_ConstraintNotFulfilled
source: Constraint not fulfilled
de: Attributbedingung ist nicht erfüllt

# MaxSlope_SlopeTooSteep
source: Slope is too steep
de: Gefälle ist zu gross

# LineConnectionFieldValues_ConstraintNotFulfilled_Line
source: Field values do not match line constraint
de: Feldwerte verletzen die Linienbedingung

# LineConnectionFieldValues_ConstraintNotFulfilled_LineAndPoint
source: Field values do not match point constraint and line constraint
de: Feldwerte verletzen die Punktbedingung und die Linienbedingung

# LineConnectionFieldValues_ConstraintNotFulfilled_Point
source: Field values do not match point constraint
de: Feldwerte verletzen die Punktbedingung

# MinNodeDistance_NodeDistanceTooSmall
source: Distance between nodes smaller than allowed minimum
de: Abstand zwischen Punkten ist kleiner als der erlaubte Minimalwert

# MinNodeDistance_NodeDistanceTooSmall_ConstraintNotFulfilled
source: Distance between nodes smaller than allowed minimum (attribute constraint is not fulfilled)
de: Abstand zwischen Punkten ist kleiner als der erlaubte Minimalwert (Attributbedingung ist nicht erfüllt)

# MinNodeDistance_ZDifferenceTooLarge
source: Difference in Z value larger than allowed maximum
de: Z-Unterschied ist grösser als der erlaubte Maximalwert

# MinNodeDistance_ZDifferenceTooLarge_ConstraintNotFulfilled
source: Difference in Z value larger than allowed maximum (attribute constraint is not fulfilled)
de: Z-Unterschied ist grösser als der erlaubte Maximalwert (Attributbedingung ist nicht erfüllt)

# MonotonicMeasures_MeasuresNotMonotonic
source: Measure values are not monotonic
de: M-Werte sind nicht monoton steigend/fallend

# MpAllowedPartTypes_InvalidGeometryType
source: Invalid geometry type in multipatch
de: Unerlaubter Geometrietyp in Multipatch

# MpConstantPointIdsPerRing_DifferentIdInRing
source: Point IDs in Multipatch ring are not constant
de: Punkt-IDs im Multipatch sind nicht konstant

# MpConstantPointIdsPerRing_InnerRingIdDifferentFromOuterRingId
source: Point IDs in outer ring are constant but IDs in inner ring are different
de: Punkt-IDs in äußerem Ring sind konstant, aber die IDs in einem inneren Ring weichen von diesem Wert ab

# MustBeNear_NoFeatureWithinDistance
source: No feature found within the maximum distance
de: Kein Feature gefunden innerhalb des definierten Maximalabstands

# MustBeNear_NoFeatureWithinDistance_WithFulfilledConstraint
source: No feature with fulfilled constraint found within the maximum distance
de: Kein Feature mit erfüllter Attributbedingung gefunden innerhalb des definierten Maximalabstands

# SegmentTypes_NonLinearSegments
source: Non-linear segment(s) found
de: Nicht lineare(s) Segment(e) gefunden

# SegmentTypes_NonLinearSegments_Bezier
source: Bezier segment(s) found
de: Bézier-Segment(e) gefunden

# SegmentTypes_NonLinearSegments_CircularArc
source: Circular arc segment(s) found
de: Kreisbogensegment(e) gefunden

# SegmentTypes_NonLinearSegments_EllipticArc
source: Elliptic arc segment(s) found
de: Elliptische Bogensegment(e) gefunden

# SegmentLength_SmallerThanLimit_ConsecutiveSegments
source: Consecutive segment lengths smaller than limit
de: Aufeinanderfolgende Segmente unterschreiten die Minimallänge

# SegmentLength_SmallerThanLimit_OneSegment
source: Segment length smaller than limit
de: Segment unterschreitet die Minimallänge

# SmoothZProfile_AbruptChangeInSlopeAngle
source: Abrupt change in slope angle
de: Abrupter Gefällewechsel

# WithinZRange_ZOutsideRange_AboveMaximum
source: Z value(s) above the valid range
de: Z-Wert(e) oberhalb des definierten Wertebereichs

# WithinZRange_ZOutsideRange_BelowMinimum
source: Z value(s) below the valid range
de: Z-Wert(e) unterhalb des definierten Wertebereichs

# ValidNonLinearSegments_CicularArc_NoCenterPoint
source: Circular arc has no center point
de: Kreisbogen hat keinen definierten Mittelpunkt
