Repository: ProSuite/ProSuite
Catalog: src/ProSuite.QA.Tests/IssueCodes/IssueCodeDescriptions.*.resx
Languages: de

# BoundaryLoops_BoundaryLoop
source: Boundary loop found
de: Geschlossene Schleife in Polygongrenze gefunden

# BoundaryLoops_BoundaryLoop_AreaLargerThanLimit
source: Boundary loop larger than maximum allowed area found
de: Geschlossene Schleife in Polygongrenze größer als definierte Maximalfläche gefunden

# BoundaryLoops_BoundaryLoop_AreaSmallerThanLimit
source: Boundary loop smaller than minimum allowed area found
de: Geschlossene Schleife in Polygongrenze kleiner als definierte Minimalfläche gefunden

# BoundaryLoops_BoundaryLoop_UnableToConstructLoopPolygon
source: Boundary loop found, but the loop polygon can not be constructed
de: Geschlossene Schleife in Polygongrenze gefunden, aber das Polygon für die Schleife kann nicht konstruiert werden

# CodedValues_NamesNotUnique
source: Coded value names are not unique within the domain
de: Die Namen von codierten Werten sind nicht eindeutig innerhalb der Domäne

# CodedValues_NoName
source: Coded value has no name
de: Ein codierter Wert hat keinen Namen

# CodedValues_NotEnoughNamesDifferentFromValue
source: The number of coded values with a name different from the value is not sufficient
de: Die Anzahl codierter Werte, deren Namen vom Wert abweicht, ist zu klein

# CodedValues_TextLength_TooLong
source: Length of coded value name exceeds maximum value
de: Der Name des codierten Werts ist zu lang

# CodedValues_TextLength_TooShort
source: Length of coded value name is less than minimum value
de: Der Name des codierten Werts ist zu kurz

# CodedValues_TooFewCodedValues
source: Number of coded values is less than minimum value
de: Die Anzahl codierter Werte in der Domäne ist zu klein

# Constraints_ConstraintNotFulfilled
source: The constraint is not fulfilled
de: Die Attributbedingung ist nicht erfüllt

# Constraints_ErrorEvaluatingExpression
source: Error evaluating constraint expression
de: Fehler bei der Auswertung der Attributbedingung

# ContainsOther_NoContainingFeature
source: The feature is not contained
de: Das Feature liegt nicht komplett innerhalb eines umschließenden Features

# ContainsOther_NoContainingFeature_WithFulfilledConstraint
source: The feature is contained, but the constraint is not fulfilled for any of the containing features
de: Das Feature liegt komplett innerhalb (mindestens) eines umschließenden Features, aber die Attributbedingung ist für keines dieser umschließenden Features erfüllt

# CoveredByOther_NotCoveredByAnyFeature
source: The feature is not covered by any feature
de: Das Feature ist durch kein anderes Feature abgedeckt

# CoveredByOther_NotCoveredByAnyFeature_PartlyOutsideVerifiedExtent
source: The feature is not covered by any feature within the verified extent (the tested feature extends beyond the verified extent)
de: Das Feature ist innerhalb des geprüften Ausschnitts durch kein anderes Feature abgedeckt (das geprüfte Feature erstreckt sich bis außerhalb des geprüften Ausschnitts)

# CoveredByOther_NotFullyCovered
source: The feature is not fully covered by other features
de: Das Feature ist nicht vollständig durch andere Features abgedeckt

# CoveredByOther_NotSufficientlyCovered
source: The feature is not sufficiently covered by other features (the covered percentage is smaller than the minimum value)
de: Das Feature ist nicht ausreichend durch andere Features abgedeckt (der abgedeckte prozentuale Anteil ist kleiner als der Minimalwert)

# Crosses_GeometriesCross
source: The feature geometries cross each other
de: Die Feature-Geometrien kreuzen einander

# Crosses_GeometriesCross_ConstraintNotFulfilled
source: The feature geometries cross each other and the attribute constraint is not fulfilled
de: Die Feature-Geometrien kreuzen einander, ohne dass die Attributbedingung erfüllt ist

# DateValues_UnrecognizedDateValue
source: Error reading date value from field
de: Fehler beim Lesen des Datumswerts aus dem Feld

# DateValues_ValueAfterLatestValidDate
source: Date value is after latest valid date
de: Der Datumswert liegt nach dem maximalen gültigen Datum

# DateValues_ValueBeforeEarliestValidDate
source: Date value is before earliest valid date
de: Der Datumswert liegt vor dem maximalen gültigen Datum

# DomainDescriptions_NotUnique
source: Domain descriptions are not unique
de: Die Domänenbeschreibungen sind nicht eindeutig

# DomainDescriptions_TextLength_TooLong
source: Length of domain description exceeds maximum value
de: Die Länge der Domänenbeschreibung überschreitet den eingestellten Maximalwert

# DomainNameRegex_MatchingErrorPattern
source: The domain name matches the error pattern
de: Der Domänenname stimmt mit dem Muster für ungültige Namen überein

# DomainNameRegex_NotMatchingExpectedPattern
source: The domain name does not match the expected pattern
de: Der Domänenname stimmt nicht mit dem erwarteten Muster überein

# DomainNames_Case_AllLower
source: Domain name contains only lower-case characters
de: Der Domänenname enthält nur Kleinbuchstaben

# DomainNames_Case_AllUpper
source: Domain name contains only upper-case characters
de: Der Domänenname enthält nur Großbuchstaben

# DomainNames_Case_NotAllLower
source: Domain name contains upper-case characters
de: Der Domänenname enthält Großbuchstaben

# DomainNames_Case_NotAllUpper
source: Domain name contains lower-case characters
de: Der Domänenname enthält Kleinbuchstaben

# DomainNames_Case_NotMixed
source: Domain name is not in mixed-case
de: Der Domänenname enthält nicht sowohl Klein- als auch Großbuchstaben

# DomainNames_DoesNotContainFieldName
source: The domain name does not contain the name of the field for which it is used
de: Der Domänename enthält nicht den Namen des Felds, für welches die Domäne verwendet wird

# DomainNames_DoesNotStartWithPrefix
source: The domain name does not start with the expected prefix
de: Der Domänenname beginnt nicht mit dem erwarteten Präfix

# DomainNames_TextLength_TooLong
source: Length of domain name exceeds maximum value
de: Der Domänenname ist zu lang

# DomainNames_TextLength_TooShort
source: Length of domain name is less than minimum value
de: Der Domänenname ist zu kurz

# Duplicates_GeometriesEqualInXY
source: The feature geometries are equal in XY
de: Die Feature-Geometrien sind deckungsgleich in XY

# Duplicates_GeometriesEqualInXY_ConstraintNotFulfilled
source: The feature geometries are equal in XY and the attribute constraint is not fulfilled
de: Die Feature-Geometrien sind deckungsgleich in XY, ohne dass die Attributbedingung erfüllt ist

# EmptyGeometry_GeometryEmpty
source: The geometry is empty
de: Die Geometrie ist leer

# EmptyGeometry_GeometryNull
source: The geometry is null
de: Die Geometrie ist NULL

# FieldAliases_Case_AllLower
source: Alias name contains only lower-case characters
de: Der Aliasname enthält nur Kleinbuchstaben

# FieldAliases_Case_AllUpper
source: Alias name contains only upper-case characters
de: Der Aliasname enthält nur Großbuchstaben

# FieldAliases_Case_NotAllLower
source: Alias name contains upper-case characters
de: Der Aliasname enthält Großbuchstaben

# FieldAliases_Case_NotAllUpper
source: Alias name contains lower-case characters
de: Der Aliasname enthält Kleinbuchstaben

# FieldAliases_Case_NotMixed
source: Alias name is not in mixed-case
de: Der Aliasname enthält nicht sowohl Klein- als auch Großbuchstaben

# FieldAliases_EqualsFieldName
source: Alias name is same as field name
de: Der Aliasname ist gleich wie der Feldname

# FieldAliases_EqualsFieldName_ExceptCase
source: Alias name differs from field name only in character case
de: Der Aliasname unterscheidet sich vom Feldnamen nur durch Groß-/Kleinschrift

# FieldAliases_NoAliasName
source: Alias name is not defined
de: Der Aliasname ist nicht definiert

# FieldAliases_NotUnique
source: Alias name is not unique within table
de: Der Aliasname ist nicht einmalig innerhalb der Tabellendefinition

# FieldAliases_SystemFieldAliasDiffersFromName
source: Alias name of system field is not equal to the field name
de: Der Aliasname eines Systemfelds ist nicht gleich wie der Feldname

# FieldAliases_TextLength_TooLong
source: Length of alias name exceeds maximum value
de: Der Aliasname ist zu lang

# FieldAliases_TextLength_TooShort
source: Length of alias name is less than minimum value
de: Der Aliasname ist zu kurz

# FieldDomains_FieldTypeMismatch
source: The domain is used for a field with a different data type
de: Die Domäne wird für ein Feld verwendet, welches einen anderen Datentyp aufweist

# FieldNameRegex_MatchingErrorPattern
source: The field name matches the error pattern
de: Der Feldname stimmt mit dem Muster für ungültige Namen überein

# FieldNameRegex_NotMatchingExpectedPattern
source: The field name does not match the expected pattern
de: Der Feldname stimmt nicht mit dem erwarteten Muster überein

# FieldNames_Case_AllLower
source: Field name contains only lower-case characters
de: Der Feldname enthält nur Kleinbuchstaben

# FieldNames_Case_AllUpper
source: Field name contains only upper-case characters
de: Der Feldname enthält nur Großbuchstaben

# FieldNames_Case_NotAllLower
source: Field name contains upper-case characters
de: Der Feldname enthält Großbuchstaben

# FieldNames_Case_NotAllUpper
source: Field name contains lower-case characters
de: Der Feldname enthält Kleinbuchstaben

# FieldNames_Case_NotMixed
source: Field name is not in mixed-case
de: Der Feldname enthält nicht sowohl Klein- als auch Großbuchstaben

# FieldNames_SubstringNotUnique
source: First characters of field name are not unique within table
de: Die ersten Zeichen des Feldnamens sind nicht eindeutig innerhalb der Tabelle

# FieldNames_TextLength_TooLong
source: Length of field name exceeds maximum value
de: Der Feldname ist zu lang

# FieldNames_TextLength_TooShort
source: Length of field name is less than minimum value
de: Der Feldname ist zu kurz

# FieldProperties_MissingField
source: Required field does not exist
de: Erforderliches Feld fehlt

# FieldProperties_NoDomain
source: The field does not have a domain assigned, but there is a domain specified for it
de: Dem Feld ist keine Domäne zugeordnet, obwohl für das Feld eine Domäne vorgeschrieben ist

# FieldProperties_UnexpectedAlias
source: The field does not have the specified alias name
de: Das Feld hat nicht den vorgeschriebenen Aliasnamen

# FieldProperties_UnexpectedDomain
source: The field has an unexpected domain assigned
de: Dem Feld ist eine andere als die vorgeschriebene Domäne zugeordnet

# FieldProperties_UnexpectedFieldLength
source: The field does not have the specified field length
de: Das Feld hat nicht die vorgeschriebene Feldlänge

# FieldProperties_UnexpectedFieldNameForAlias
source: Alias name matches a field specification, but field name is different
de: Der Aliasname ist gleich wie jenes eines vorgeschriebenen Felds, aber der Feldname entspricht nicht dem vorgeschriebenen Name

# FieldProperties_UnexpectedFieldType
source: The field does not have the specified field type
de: Das Feld hat nicht den vorgeschriebenen Datentyp

# FieldValues_ValueNotValidForFieldType
source: The field value is not valid for the field type
de: Der Feldwert ist nicht gültig für den Datentyp des Felds

# ForeignKeys_NoReferencedRow
source: Field values don't reference a row in the target table
de: Die Feldwerte referenzieren keine Zeile in der Zieltabelle

# ForeignKeys_UnableToConvertFieldValue
source: Unable to convert a field value to the target field type
de: Der Feldwert kann nicht in den Datentyp des referenzierten Feldes umgewandelt werden

# ForeignKeys_UnexpectedReferencedRow
source: Field values incorrectly reference a row in the target table
de: Die Feldwerte referenzieren unerlaubterweise eine Zeile in der Zieltabelle

# Gaps_Gap
source: Gap found
de: Lücke gefunden

# Gaps_Gap_AreaTooSmall
source: Gap found with area smaller than minimum value
de: Lücke gefunden mit einer Fläche kleiner als der Minimalwert

# Gaps_Gap_AreaTooSmallAndSliverRatioTooLarge
source: Gap found with area smaller than minimum value and ratio of perimeter (squared) to area larger than maximum value
de: Lücke gefunden mit einer Fläche kleiner als der Minimalwert und einem Verhältnis zwischen Umfang im Quadrat zur Fläche, welches den Maximalwert überschreitet

# Gaps_Gap_SliverRatioTooLarge
source: Gap found with ratio of perimeter (squared) to area larger than maximum value
de: Lücke gefunden mit einem Verhältnis zwischen Umfang im Quadrat zur Fläche, welches den Maximalwert überschreitet

# InteriorIntersects_InteriorsIntersect
source: The interiors of feature geometries intersect each other
de: Die Innenbereiche der Feature-Geometrien überschneiden sich

# InteriorIntersects_InteriorsIntersect_ConstraintNotFulfilled
source: The interiors of feature geometries intersect each other and the attribute constraint is not fulfilled
de: Die Innenbereiche der Feature-Geometrien überschneiden sich, ohne dass die Attributbedingung erfüllt ist

# InteriorRings_UnallowedInteriorRings
source: The polygon has an unallowed number of interior rings
de: Das Polygon hat eine unerlaubte Anzahl innerer Ringe

# IntersectionMatrix_GeometriesIntersectWithMatrix
source: The feature geometries intersect according to a 9IM intersection matrix
de: Die Feature-Geometrien überschneiden sich gemäß einer 9IM-Überschneidungsmatrix

# IntersectionMatrix_GeometriesIntersectWithMatrix_ConstraintNotFulfilled
source: The feature geometries intersect according to a 9IM intersection matrix and the attribute constraint is not fulfilled
de: Die Feature-Geometrien überschneiden sich gemäß einer 9IM-Überschneidungsmatrix, ohne dass die Attributbedingung erfüllt ist

# Intersects_GeometriesIntersect
source: The feature geometries intersect each other
de: Die Feature-Geometrien schneiden sich

# Intersects_GeometriesIntersect_ConstraintNotFulfilled
source: The feature geometries intersect each other and the attribute constraint is not fulfilled
de: Die Feature-Geometrien schneiden sich, ohne dass die Attributbedingung erfüllt ist

# MaxArea_AreaTooLarge
source: Area is larger than maximum value
de: Die Fläche ist größer als der Maximalwert

# MaximumLength_LengthTooLarge
source: The length of the geometry is larger than the maximum value
de: Die Länge der Geometrie ist größer als der Maximalwert

# MaxVertexCount_TooManyVertices
source: The geometry contains too many vertices
de: Die Geometrie enthält zu viele Stützpunkte

# MeasureValues_InvalidMValues
source: Measure values are not valid
de: Messwerte sind nicht gültig

# MeasureValues_UndefinedMValues
source: Measure values are not defined
de: Messwerte sind nicht definiert

# MinArea_AreaTooSmall
source: Area is smaller than minimum value
de: Die Fläche ist kleiner als der Minimalwert

# MinimumLength_LengthTooSmall
source: The length of the geometry is smaller than the minimum value
de: Die Länge der Geometrie ist kleiner als der Minimalwert

# MinimumSegmentAngle_SegmentAngleTooSmall
source: The angle between two segments is smaller than the minimum value
de: Der Winkel zwischen zwei Segmenten ist kleiner als der Minimalwert

# Multipart_MultipleExteriorRings
source: The polygon consists of more than one exterior ring
de: Das Polygon besteht aus mehr als einem äußeren Ring

# Multipart_MultipleParts
source: The geometry consists of more than one part
de: Die Geometrie besteht aus mehreren Teilstücken

# NodeLineCoincidence_NodeTooCloseToLine_BetweenFeatures
source: Unconnected node is too close to a line (between different features)
de: Der nicht verknüpfte Knoten liegt zu nahe bei einer Linie (zwischen unterschiedlichen Features)

# NodeLineCoincidence_NodeTooCloseToLine_WithinFeature
source: Unconnected node is too close to a line (within the same feature)
de: Der nicht verknüpfte Knoten liegt zu nahe bei einer Linie (desselben Features)

# Overlaps_GeometriesOverlap
source: The feature geometries overlap each other
de: Die Feature-Geometrien überlappen einander

# Overlaps_GeometriesOverlap_ConstraintNotFulfilled
source: The feature geometries overlap each other and the attribute constraint is not fulfilled
de: Die Feature-Geometrien überlappen einander, ohne dass die Attributbedingung erfüllt ist

# RequiredFields_EmptyString
source: Required field contains an empty string
de: Pflichtfeld enthält einen leeren Textstring

# RequiredFields_NullValue
source: Required field contains NULL value
de: Pflichtfeld enthält NULL

# ReservedFieldNames_FieldNameIsReserved
source: The field uses a reserved name
de: Das Feld verwendet eine reservierte Namensbezeichnung

# RowCount_TooFewRows
source: Number of rows is less than minimum value
de: Die Anzahl Zeilen ist kleiner als der Minimalwert

# RowCount_TooManyRows
source: Number of rows exceeds maximum value
de: Die Anzahl Zeilen ist größer als der Maximalwert

# SimpleGeometry_DuplicatePoints
source: Duplicate points
de: Doppelte Punkte

# SimpleGeometry_EmptyPart
source: Empty geometry part
de: Leerer Geometrieteil

# SimpleGeometry_EmptyShape
source: Geometry is empty
de: Die Geometrie ist leer

# SimpleGeometry_IdenticalRings
source: Identical rings
de: Identische Ringe

# SimpleGeometry_NullShape
source: Geometry is null
de: Die Geometrie ist NULL

# SimpleGeometry_RingOrientation
source: Incorrect ring orientation
de: Inkorrekte Ring-Orientierung

# SimpleGeometry_SegmentOrientation
source: Incorrect segment orientation
de: Inkorrekte Segment-Orientierung

# SimpleGeometry_SelfIntersection
source: Self intersection
de: Selbstüberschneidung

# SimpleGeometry_ShortSegment
source: Short segment
de: Kurzes Segment

# SimpleGeometry_UnclosedRing
source: Unclosed ring
de: Nicht geschlossener Ring

# SimpleGeometry_Undefined
source: Undefined non-simple reason
de: Nicht definierter Grund für Verletzung der Simple-Bedingung

# SimpleGeometry_Unknown
source: Unknown non-simple reason
de: Unbekannter Grund für Verletzung der Simple-Bedingung

# SliverPolygons_AreaTooSmall
source: Area is smaller than minimum value
de: Die Fläche ist kleiner als der Minimalwert

# SliverPolygons_AreaTooSmallAndSliverRatioTooLarge
source: Area is smaller than minimum value, and the ratio of perimeter (squared) to area is larger than maximum value
de: Die Fläche ist kleiner als der Minimalwert und das Verhältnis zwischen Umfang im Quadrat zur Fläche überschreitet den Maximalwert

# SliverPolygons_SliverRatioTooLarge
source: The ratio of perimeter (squared) to area is too large
de: Das Verhältnis zwischen Umfang im Quadrat zur Fläche überschreitet den Maximalwert

# SpatialReference_CoordinateSystemDifferent_XY
source: The XY coordinate system is different
de: Das XY-Koordinatensystem ist unterschiedlich

# SpatialReference_CoordinateSystemDifferent_Z
source: The Z coordinate system is different
de: Das Z-Koordinatensystem ist unterschiedlich

# SpatialReference_PrecisionDifferent_M
source: The M domain/precision is different
de: Die M-Auflösung ist unterschiedlich

# SpatialReference_PrecisionDifferent_XY
source: The XY domain/precision is different
de: Die XY-Auflösung ist unterschiedlich

# SpatialReference_PrecisionDifferent_Z
source: The Z domain/precision is different
de: Die Z-Auflösung ist unterschiedlich

# SpatialReference_ToleranceDifferent_M
source: The M tolerance is different
de: Die M-Toleranz ist unterschiedlich

# SpatialReference_ToleranceDifferent_XY
source: The XY tolerance is different
de: Die XY-Toleranz ist unterschiedlich

# SpatialReference_ToleranceDifferent_Z
source: The Z tolerance is different
de: Die Z-Toleranz ist unterschiedlich

# Touches_GeometriesTouch
source: The feature geometries touch each other
de: Die Feature-Geometrien berühren einander

# Touches_GeometriesTouch_ConstraintNotFulfilled
source: The feature geometries touch each other and the attribute constraint is not fulfilled
de: Die Feature-Geometrien berühren einander, ohne dass die Attributbedingung erfüllt ist

# TouchingParts_PartsTouch
source: Geometry parts touch
de: Die Geometrie enthält sich berührende Teile

# TrimmedTextFields_ErrorReadingString
source: Error reading text from field
de: Fehler beim Lesen des Textstrings

# TrimmedTextFields_LeadingAndTrailingBlanks
source: The text has blanks both at the beginning and the end
de: Der Text enthält Leerzeichen sowohl am Beginn als auch am Ende

# TrimmedTextFields_LeadingBlanks
source: The text has one or more blanks at the beginning
de: Der Text beginnt mit (einem oder mehreren) Leerzeichen

# TrimmedTextFields_OnlyBlanks
source: The text consists only of one or more blanks
de: Der Text besteht nur aus (einem oder mehreren) Leerzeichen

# TrimmedTextFields_TrailingBlanks
source: The text has one or more blanks at the end
de: Der Text endet mit (einem oder mehreren) Leerzeichen

# UniqueFields_NotUnique
source: Field values are not unique
de: Feldwerte sind nicht eindeutig

# WithinBox_GeometryNotWithinBox
source: The geometry is not fully within the expected extent
de: Die Geometrie liegt nicht vollständig innerhalb des erwarteten Ausschnitts

# GdbAttributeRules_InvalidObjectID
source: Invalid object ID value
de: Ungültige Objekt-ID

# GdbAttributeRules_InvalidSubtype
source: Invalid subtype field value
de: Ungültiger Wert für das Subtyp-Feld

# GdbAttributeRules_ValueNotValidForDomain
source: Field value is not valid for domain
de: Der Feldwert ist nicht gültig für die Domäne

# GeodatabaseRelease_IncorrectVersion_TooHigh
source: The geodatabase release version is too high
de: Die Version des Geodatabase-Release ist zu hoch

# GeodatabaseRelease_IncorrectVersion_TooLow
source: The geodatabase release version is too low
de: Die Version des Geodatabase-Release ist zu tief

# GeodatabaseRelease_UnableToDetermineRelease
source: Unable to determine the geodatabase release version
de: Die Version des Geodatabase-Release kann nicht ermittelt werden

# ZRangeDifference_ZDifferenceTooSmall
source: The Z distance between the feature Z ranges is too small
de: Der Z-Abstand zwischen den Z-Bereichen der Features ist zu klein

# ZRangeDifference_ZRangesOverlap
source: The feature Z ranges overlap
de: Die Z-Bereiche der Features überlappen sich

# CrossingLines_NoMatch_NoCandidate
source: No matching neighbor feature. No neighbor feature connected to the border found within the search distance.
de: Es existiert kein mit der Grenze verbundenes Nachbar-Feature innerhalb der Suchdistanz.

# CrossingLines_Match_ConstraintsNotFulfilled
source: A matching neighbor feature exists, but attribute constraints are not fulfilled.
de: Es existiert ein passendes Nachbar-Feature, aber Attributbedingungen sind nicht erfüllt.

# CrossingLines_NoMatch_CandidateExists_ConstraintsFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature.

# CrossingLines_NoMatch_CandidateExists_BordersNotCoincident_ConstraintsFulfilled
source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. The borders are not coincident at the line end points.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Grenzverläufe stimmen bei den Linienendpunkten nicht überein.

source: No matching neighbor feature. There is a nearby neighbor feature connected to the border. Attribute constraints are not fulfilled with that feature. The borders are not coincident at the line end points.
de: Kein passendes Nachbar-Feature. In der Nähe existiert ein mit der Grenze verbundenes Nachbar-Feature. Die Attributbedingungen sind für dieses Feature nicht erfüllt. Die Grenzverläufe stimmen bei den Linienendpunkten nicht überein.
