Repository: ProSuite/ProSuite
Catalog: src/ProSuite.QA.Tests/IssueCodes/IssueCodeDescriptions.*.resx
Languages: de

# ValidNonLinearSegments_CircularArc_ChordHeightTooSmall
source: Chord height of circular arc is too small
de: Segmenthöhe des Kreisbogens ist zu klein

# ValidUrls_CannotAccessResource_FileSystem_NoReadAccess
source: The specified file exists but cannot be read
de: Die referenzierte Datei existiert aber kann nicht gelesen werden

# ValidUrls_CannotAccessResource_FileSystem_PathDoesNotExist
source: The specified file system path does not exist
de: Die referenzierte Datei existiert nicht

# ValidUrls_CannotAccessResource_Web_ErrorGettingResponse
source: Error getting a response from the server
de: Fehler beim Aufruf der Server-Ressource

# ValidUrls_CannotAccessResource_Web_InvalidResponse
source: The server returned an error code for the request
de: Der Server meldete einen Fehlercode zurück

# ValidUrls_UnsupportedUrlType
source: The URL type is not supported
de: Der Typ der URL ist nicht unterstützt

# UnreferencedRows_ValueNotReferenced
source: Value is not referenced by any table
de: Der Wert wird von keiner Tabelle referenziert

# UnreferencedRows_ConversionError
source: An error ocurred while trying to convert a foreign key value to the field type of the primary key
de: Fehler bei der Umwandung des Fremdschlüssel-Werts in den Typ des Primärschlüssel-Felds

# ValidCoordinateFields_ErrorReadingFieldValue
source: Error reading coordinate value from field
de: Fehler beim Lesen des Koordinatenwerts aus dem Feld

# ValidCoordinateFields_ShapeIsDefinedButCoordinateFieldHasNoValue
source: The shape is defined, but the coordinate field does not contain a value
de: Die Geometrie ist definiert, aber das Koordinatenfeld enthält keinen Wert

# ValidCoordinateFields_ShapeIsUndefinedButCoordinateFieldHasValue
source: The shape is not defined, but the coordinate field has a value
de: Die Geometrie ist nicht definiert, aber das Koordinatenfeld enthält einen Wert

# ValidCoordinateFields_TextFieldValueIsNotNumeric
source: Unable to read coordinate value from text field
de: Der Koordinatenwert kann nicht aus dem Textfeld gelesen werden

# ValidCoordinateFields_XYFieldCoordinatesTooFarFromShape
source: The distance between the XY field coordinates and the shape is larger than the tolerance
de: Die Distanz zwischen den XY-Feldwerten und der Geometrie ist grösser als die Toleranz

# ValidCoordinateFields_XYFieldCoordinateValueTooFarFromShape
source: The distance between the one available XY coordinate field value and the shape is larger than the tolerance
de: Die Distanz zwischen dem einen XY-Feld und der Geometrie ist grösser als die Toleranz

# ValidCoordinateFields_ZFieldCoordinateTooFarFromShape
source: The distance between the Z field coordinate value and the shape Z value is larger than the tolerance
de: Der Unterschied zwischen dem Z-Feld-Wert und dem Z-Wert der Geometrie ist grösser als die Toleranz

# PseudoNodes_PseudoNode
source: Pseudo node
de: Pseudo-Knoten

# PointOnLine_PointNotNearLine
source: Point does not lie near line
de: Punkt liegt nicht nahe genug bei einer Linie

# RegularExpression_FieldValueDoesNotMatchRegularExpression
source: The field value does not match the regular expression
de: Der Feldwert erfüllt den regulären Ausdruck nicht

# RegularExpression_FieldValueMatchesRegularExpression
source: The field value matches the regular expression
de: Der Feldwert erfüllt den regulären Ausdruck

# RegularExpression_StringFormattingError
source: Error formatting the field's value
de: Fehler beim Umwandeln des Feldwerts in eine Zeichenkette

# PointNotNear_PointWithin
source: Point is within polygon
de: Punkt liegt innerhalb eines Polygons

# PointNotNear_PointWithin_ConstraintNotFulfilled
source: Point is within polygon and the attribute constraint is not fulfilled
de: Punkt liegt innerhalb eines Polygons, ohne dass die Attributbedingung erfüllt ist

# PointNotNear_PointTooClose
source: Point is too close to reference feature
de: Punkt liegt zu nahe bei Referenzfeature

# PointNotNear_PointTooClose_ConstraintNotFulfilled
source: Point is too close to reference feature and the attribute constraint is not fulfilled
de: Punkt liegt zu nahe bei Referenzfeature, ohne dass die Attributbedingung erfüllt ist

# OrphanNode_MissingNode
source: Missing node
de: Fehlender Knotenpunkt

# OrphanNode_OrphanNode
source: Orphan node
de: Nicht verknüpfter Knotenpunkt

# NoClosedPaths_ClosedPath
source: Closed path
de: Geschlossener Pfad

# NeighbourAreas_PolygonsTouch_NoFieldsToCompare
source: Polygons touch (no fields to compare)
de: Polygone berühren sich (keine Vergleichsfelder)

# NeighbourAreas_PolygonsTouch_ConstraintNotFulfilled
source: Polygons touch and constraint is not fulfilled
de: Polygone berühren sich, ohne dass die Attributbedingung erfüllt ist

# NeighbourAreas_PolygonsTouch_AllFieldsEqual
source: Polygons touch and have equal values for all compared fields
de: Polygone berühren sich und haben gleiche Werte für alle verglichenen Felder

# MustTouch_NoTouchingFeature
source: Feature is not touched by another feature
de: Feature wird durch kein anderes Feature berührt

# MustTouch_NoTouchingFeature_WithFulfilledConstraint
source: Feature is not touched by another feature that fulfills the constraint
de: Feature wird durch kein anderes Feature berührt, für welches die Attributbedingung erfüllt ist

# MustIntersect9IM_NoFeatureWithRequiredRelation
source: Feature does not have the required 9IM intersection relation with any other feature
de: Feature erfüllt die erforderliche 9IM-Geometriebeziehung mit keinem anderen Feature

# MustIntersect9IM_NoFeatureWithRequiredRelation_WithFulfilledConstraint
source: Feature does not have the required 9IM intersection relation with any other feature that fulfills the constraint
de: Feature erfüllt die erforderliche 9IM-Geometriebeziehung mit keinem anderen Feature, für welches die Attributbedingung erfüllt ist

# MinAngle_AngleTooSmall
source: Angle between lines is smaller then the specified minimum
de: Der Winkel zwischen den verbundenen Linien ist kleiner als der Minimalwert

# MinAngle_EndPointsDoNotFit
source: Endpoints do not fit
de: Endpunkte sind nicht deckungsgleich

source: M values are different at line connection within route
de: M-Werte sind unterschiedlich an Linienverknüpfung innerhalb einer Route

# RouteMeasuresContinuous_DifferentMeasuresAtLineConnection_OneValueIsNaN
source: One M value is NaN at line connection within route
de: Ein M-Wert ist undefiniert an Linienverknüpfung innerhalb einer Route

# RouteMeasuresUnique_MeasuresNotUnique_WithinFeature
source: Measures are not unique due to non-monotonicity within feature
de: M-Werte sind nicht eindeutig bedingt durch Nicht-Monotonizität innerhalb eines Features

# RouteMeasuresUnique_MeasuresNotUnique_WithinRoute
source: Measures are not unique for different features on same route
de: M-Werte sind nicht eindeutig für unterschiedliche Features innerhalb derselben Route

# MinIntersect_SmallIntersectionArea
source: Intersection area is smaller than the specified limit
de: Schnittfläche ist kleiner als der definierte Minimalwert

# MinMeanSegmentLength_AverageSegmentLengthBelowLimit
source: The average length of segments in the geometry is below the limit
de: Die durchschnittliche Segmentlänge in der Geometrie unterschreitet den Minimalwert

# MinMeanSegmentLength_InvalidSegmentCount
source: The geometry has an invalid segment count
de: Die Geometrie enthält eine ungültige Anzahl Segmente

# MeasuresAtPoints_ExpressionResultNotNumeric
source: Invalid value from expected measure expression
de: Ausdruck für erwarteten M-Wert resultiert in ungültigem Wert

# MeasuresAtPoints_MValueNotAsExpected
source: Actual measure value not not within tolerance of expected measure value
de: M-Wert liegt außerhalb der Toleranz vom erwarteten M-Wert

# MeasuresAtPoints_NoVertexNearPoint
source: Point does not lie closer than search distance to any line vertex
de: Kein Linienstützpunkt innerhalb der Suchdistanz vom Punkt

# MeasuresAtPoints_PointNotNearLine
source: Point does not lie closer than search distance to any line
de: Keine Linie innerhalb der Suchdistanz vom Punkt

# MeasuresAtPoints_UndefinedMValue_FromExpression
source: Undefined expected measure value from expression
de: Ausdruck für erwarteten M-Wert resultiert in undefiniertem M-Wert

# MeasuresAtPoints_UndefinedMValue_FromPointFeature
source: Undefined measure value on point feature
de: M-Wert des Punkt-Features ist nicht definiert

# LineIntersectZ_ZDifferenceAtLineIntersection_LargerThanLimit
source: Difference between Z values at line intersection is larger than the allowed maximum
de: Z-Unterschied beim Linienschnittpunkt ist grösser als der definierte Maximalwert

# LineIntersectZ_ZDifferenceAtLineIntersection_SmallerThanLimit
source: Difference between Z values at line intersection is smaller than the allowed minimum
de: Z-Unterschied beim Linienschnittpunkt ist kleiner als der definierte Minimalwert

# NearCoincidence_NearlyCoincidentSection_Connected
source: Nearly coincident section found (paths are connected)
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe sind verknüpft)

# NearCoincidence_NearlyCoincidentSection_Connected_NotFullyProcessed
source: Nearly coincident section found (paths are connected) - the geometry exceeds the verified extent
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe sind verknüpft) - die Geometrie erstreckt sich bis außerhalb des geprüften Ausschnitts

# NearCoincidence_NearlyCoincidentSection_Disjoint
source: Nearly coincident section found (paths are disjoint)
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe berühren sich nicht)

# NearCoincidence_NearlyCoincidentSection_Disjoint_NotFullyProcessed
source: Nearly coincident section found (paths are disjoint) - the geometry exceeds the verified extent
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe berühren sich nicht) - die Geometrie erstreckt sich bis außerhalb des geprüften Ausschnitts

# RepresentationConstraints_FreeRepresentation
source: Representation is a free representation
de: Die Repräsentation ist eine freie Repräsentation

# RepresentationConstraints_InvalidRuleID
source: Representation has an invalid representation rule
de: Die Repräsentation verwendet eine ungültige Repräsentationsregel

# RepresentationConstraints_InvisibleRepresentation
source: Representation is invisible
de: Die Repräsentation ist unsichtbar

# RepresentationConstraints_NoRepresentation
source: Not a representation
de: Keine Repräsentation

# RepresentationConstraints_PropertyOverride
source: Representation properties are overriden
de: Die Repräsentation hat Repräsentations-Overrides

# RepresentationConstraints_ShapeOverride
source: Representation shape is overriden
de: Die Repräsentation hat einen Shape-Override

# SpatialRelationBase_NoIntersection
source: No intersection
de: Keine Überschneidung

# MonotonicZ_ZNotMonotonic
source: Z values are not monotonic
de: Z-Werte sind nicht monoton steigend oder fallend

# LineGroupConstraints_Dangle_AtFork_Continued
source: Dangle length is too small (dangle ends at fork, and connects to other groups)
de: Länge der Abzweigung ist zu klein (Abzweigung endet an Verzweigung, verbunden mit anderen Liniengruppen)

# LineGroupConstraints_Dangle_AtFork_Discontinued
source: Dangle length is too small (dangle ends at fork, no connection to other groups)
de: Länge der Abzweigung ist zu klein (Abzweigung endet an Verzweigung, keine Verbindung zu anderen Liniengruppen)

# LineGroupConstraints_Dangle_NotAtFork_Continued
source: Dangle length is too small (dangle does not end at fork, and connects to other groups)
de: Länge der Abzweigung ist zu klein (Abzweigung endet nicht an Verzweigung, verbunden mit anderen Liniengruppen)

# LineGroupConstraints_Dangle_NotAtFork_Discontinued
source: Dangle length is too small (dangle does not end at fork, no connection to other groups)
de: Länge der Abzweigung ist zu klein (Abzweigung endet nicht an Verzweigung, keine Verbindung zu anderen Liniengruppen)

# LineGroupConstraints_Gap_ToOtherGroupType_AtFork
source: Small gap to other group of different type (gap starts at fork)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt an Verzweigung)

# LineGroupConstraints_Gap_ToOtherGroupType_NotAtFork
source: Small gap to other group of different type (gap does not start at fork)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt nicht an Verzweigung)

# LineGroupConstraints_Gap_ToSameGroupType_AtFork_CoveredByOtherGroup
source: Small gap to other group of same type (gap starts at fork and is covered by other group)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt an Verzweigung und ist abgedeckt durch andere Liniengruppe)

# LineGroupConstraints_Gap_ToSameGroupType_AtFork_NotCoveredByOtherGroup
source: Small gap to other group of same type (gap starts at fork, not covered by other group)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt an Verzweigung, nicht abgedeckt durch andere Liniengruppe)

# LineGroupConstraints_GroupTooSmall
source: Group length is too small
de: Länge der Liniengruppe ist zu klein

# LineGroupConstraints_Gap_ToSameGroupType_NotAtFork_CoveredByOtherGroup
source: Small gap to other group of same type (gap does not start at fork but is covered by other group)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt nicht an Verzweigung, abgedeckt durch andere Liniengruppe)

# LineGroupConstraints_Gap_ToSameGroupType_NotAtFork_NotCoveredByOtherGroup
source: Small gap to other group of same type (gap does not start at fork and is not covered by other group)
de: Kleine Lücke zu anderer Liniengruppe eines anderen Typs (Lücke beginnt nicht an Verzweigung, nicht abgedeckt durch andere Liniengruppe)

# MpHorizontalPerpendicular_NotSufficientlyPerpendicular_GroupOfSegments
source: The segments of this group are almost, but not sufficently perpendicular
de: Die Segmente in dieser Gruppe stehen annähernd, aber nicht ausreichend senkrecht zueinander

# MpHorizontalPerpendicular_NotSufficientlyPerpendicular_TwoSegments
source: The two segments are almost, but not sufficently perpendicular
de: Die zwei Segmente stehen annähernd, aber nicht ausreichend senkrecht zueinander

# MpVerticalFaces_NotSufficientlyVertical
source: The face is almost, but not sufficiently vertical
de: Die Fläche ist annähernd, aber nicht ausreichend senkrecht

# ThreeDConstantZ_ZDifferenceOutsideTolerance_AllValuesUnique
source: Difference between Z values for feature larger than tolerance, all values are unique
de: Der Unterschied der Z-Werte für dieses Feature ist größer als die Toleranz; alle Werte sind eindeutig

# ThreeDConstantZ_ZDifferenceOutsideTolerance_NotAllValuesUnique
source: Difference between Z values for feature larger than tolerance, not all values are unique
de: Der Unterschied der Z-Werte für dieses Feature ist größer als die Toleranz; die Werte sind nicht eindeutig

# TerrainSpikes_MaximumSlopeAndDeltaZExceeded
source: Point classified as spike (maximum Z difference and slope exceeded)
de: Der Punkt ist als "Spike" klassifiziert (maximaler Z-Abstand und Neigung zu Nachbarpunkten sind überschritten)

# GeometryConstraint_ConstraintNotFulfilled_ForShape
source: Geometry constraint is not fulfilled for shape
de: Die Geometriebedingung ist für die Feature-Geometrie nicht erfüllt

# GeometryConstraint_ConstraintNotFulfilled_ForShapePart
source: Geometry constraint is not fulfilled for geometry part
de: Die Geometriebedingung ist für den Geometrieteil nicht erfüllt

# MpSinglePartFootprint_FootprintHasMultipleParts
source: Footprint of MultiPatch feature contains more than one part
de: Der Grundriss des MultiPatch-Features umfasst mehr als einen Teil

# MpNonIntersectingRingFootprints_RingFootprintsIntersect
source: Footprints of rings intersect
de: Ring-Grundrisse überschneiden sich

# VertexCoincidence_ZDifference_CoincidentVertex_SameFeature
source: Z value of coincident vertex on same feature differs
de: Z-Wert eines zusammenfallenden Stützpunkts auf demselben Feature ist unterschiedlich

# VertexCoincidence_ZDifference_CoincidentVertex_DifferentFeature
source: Z value of coincident vertex on different feature differs
de: Z-Wert eines zusammenfallenden Stützpunkts auf anderem Feature ist unterschiedlich

# VertexCoincidence_ZDifference_CoincidentEdge_SameFeature
source: Z value along a coincident edge on same feature differs
de: Z-Wert entlang einer zusammenfallenden Kante auf demselben Feature ist unterschiedlich

# VertexCoincidence_ZDifference_CoincidentEdge_DifferentFeature
source: Z value along a coincident edge on different feature differs
de: Z-Wert entlang einer zusammenfallenden Kante auf anderem Feature ist unterschiedlich

# NearCoincidence_NearlyCoincidentSection_WithinNear
source: Segments are fully within near distance of other segments
de: Segmente liegen vollständig innerhalb des Annäherungsbereichs von anderen Segmenten

# NearCoincidence_NearlyCoincidentSection_Crossing
source: Nearly coincident section found (paths are crossing but not connected)
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe kreuzen sich, sind aber nicht verknüpft)

# NearCoincidence_NearlyCoincidentSection_Crossing_NotFullyProcessed
source: Nearly coincident section found (paths are crossing but not connected) - the geometry exceeds the verified extent
de: Fast zusammenfallender Linienverlauf gefunden (die Verläufe kreuzen sich, sind aber nicht verknüpft) - die Geometrie erstreckt sich bis außerhalb des geprüften Ausschnitts

# NearCoincidence_NearlyCoincidentSection_Connected_Loop
source: Connected segments within near distance form a loop
de: Verknüpfte Segmente bilden eine geschlossene Schleife innerhalb des eigenen Annäherungsbereichs

# NearCoincidence_NearlyCoincidentSection_Connected_Loop_WithinNear
source: Connected segments form a loop and are within near distance to other connected segments
de: Verknüpfte Segmente bilden eine geschlossene Schleife und liegen innerhalb des Annäherungsbereichs von anderen Segmenten

# NearCoincidence_NearlyCoincidentSection_WithinNear_Connected
source: Segments are fully within near distance of other segments to which they are connected
de: Segmente liegen vollständig innerhalb des Annäherungsbereichs von anderen Segmenten, mit denen sie verknüpft sind

# NearCoincidence_InconsistentLineSymbolEnd
source: Inconsistent line symbol end (end segment is too short compared to the symbol width)
de: Inkonsistentes Liniensymbol-Ende (letztes Segment ist zu kurz im Vergleich zur Symbolbreite)

# NearCoincidence_CoincidentSection
source: Coincident section found
de: Linienverläufe sind deckungsgleich

# NearCoincidence_ShortSubpart
source: Feature with unconnected ends is too short
de: Feature mit nicht verknüpftem Endpunkt ist zu kurz

# ValidUrls_UnsupportedUrlFormat
source: Unsupported URL format
de: Das Format der URL ist nicht unterstützt

# ContainedPoints_NotClosedLine
source: Unclosed line
de: Nicht geschlossene Linie
